{
"total_item":2,
"author":[
  "ARWAN RAHMAN SHUPTO","KAWSAR SIKDER"
],
"type":[
"Lifestyle and personal growth","Tech and productivity","Storytelling & Reflections","Learning and Curiosity"
],
"title":[
"How to enjoy free time in peace in the beach","Cool Open Source Projects You Probably Haven't Heard Of"
],
"publish":[
  "April 18, 2025","April 30, 2025"
],
"min_content":[
"To enjoy life peacefully at the beach, prioritize relaxation and mindful engagement with your surroundings. Embrace activities like walking or swimming, and enjoy a peaceful moment with a book or a picnic. Connect with nature by meditating on the shore or breathing in the fresh air.",
"Open source projects are the heart of innovation in tech which is created by the developers passionately and freely and often maintained by communities who are interested and love to bulid ontribute on that perticular subject."
],
"content":[
  "<p>Focus on the present moment and appreciate the beauty of the beach and its sounds.    <br>Here's a more detailed approach:    <ol>      <li><strong>Prioritize Relaxation:</strong><br>     Unplug:     Put aside your phone and other distractions to fully immerse yourself in the beach experience.      <br><br>Mindfulness:     Engage in activities like meditation, yoga, or deep breathing exercises to calm your mind and body.      <br><br>Enjoy the Senses:     Focus on the sounds of the waves, the smell of the sea air, and the feeling of sand between your toes.      </li>      <br>      <li><strong>Embrace Nature:</strong><br>     Water Activities:     Swim, kayak, or paddleboard to connect with the ocean and enjoy its soothing presence.      <br><br>Nature Walks:     Take a leisurely stroll along the shore, observing the wildlife and the beauty of the coastline.      <br><br>Meditation:     Find a peaceful spot and meditate, focusing on the rhythm of the waves and the beauty of the surroundings.       </li>      <br>      <li><strong>Engage in Meaningful Activities:</strong><br>     Read a Book: Find a comfortable spot and lose yourself in a good book.      <br><br>Picnic: Enjoy a delicious meal with friends or family, savoring the flavors and the scenery.      <br><br>Create Memories: Take photos, play beach games, or build sandcastles with loved ones.       </li><br>      <li><strong>Practice Gratitude:</strong><br>     Appreciate the Beauty: Take a moment to appreciate the natural beauty of the beach and the ocean.      <br><br>Focus on Positives: Remember the positives in your life and let go of worries and stress.      <br><br>Be Present: Embrace the present moment and savor the experience of being at the beach.</li><br><li><strong>Take Care of Yourself:</strong><br>Sun Protection: Protect your skin from the sun by wearing sunscreen and a hat.<br><br>Stay Hydrated: Drink plenty of water to stay refreshed and healthy.<br><br>Get Enough Sleep: Prioritize sleep to help your body and mind recover and rejuvenate.</li><br></ol></p>",
  "<p>Here are some open source project that might peak your interest.<br><ol><center><img width='90%' src='gallery/kawsar/excalidraw.png'></center><br><li><a href='https://excalidraw.com/'>Excalidraw</a></li>An easy and fast way for drawing. This can be used to present live presentation online or could be used by a teacher alternative of white board. Also the board can be shared via link so that multiple people can use it for brain-storming or making plans or anything where you got to share a page full of passion with your friend, seniors or many more.<br><br>Why it's cool:<ul><li>Perfect for brainstorming or creating wireframes</li><li>Can be self-hosted</li><li>Real-time collaboration</li></ul><br><hr><center><img width='90%' src='gallery/kawsar/libreoffice.png'></center><br><li><a href='https://www.libreoffice.org/'>LibreOffice</a></li>In a world dominated by commercial software suites, LibreOffice stands as a shining example of what the open-source community can achieve. Whether you’re a student writing a thesis or a presentation or spreadsheet LibreOffice got you all covered. Its simple, robust and most importantly free alternative to proprietary office software.<br><br>What it covers:<ul><li>Writer (Word processing)</li><li>Calc (Spreadsheets/ Excel sheet)</li><li>Draw (Vector graphics andflowcharts)</li><li>Impress (Presentation/ PowerPoint presentation)</li><li>Base (Databases)</li><li>Math (Formula editing)</li></ul><hr><br><center><img width='90%' src='gallery/kawsar/gimp.png'></center><br><li><a href='https://www.gimp.org/'>GIMP</a></li>GIMP is a cross-platform image editor supporting GNU/Linux, macOS, Windows and many operating systems. It’s free compered to other software like <u>Adobe</u>. It’s designed for graphic designer, photographer, illustrator or even scientist pact with sophisticated tools that may improve your productivity. It also comes with 3rd party plugins for easy editing also many customization options.<br><br>It’s cool because:<br><ul><li>Supports various format of files like png,webp and even pdf</li><li>Various tools for editing</li><li>Supports shortcut for tools</li><li>Exporting as various format</li><li>Supports 3rd party plugins</li></ul><hr> <center><img width='90%' src='gallery/kawsar/kdenlinve.png'></center><br><li><a href='https://kdenlive.org//'>Kdenlive</a></li>Kdenlive is a free and open source video editor. It is the acronym for KDE Non-Linear Video Editor and works on Linux, Windows, macOS, and BSD. For those who wants to make YouTube video or shorts or a video with subtitle or just simply edit a video this open source video editor got you cover. With a variety range of customizations, effects and robustness it can be anyone's favorite video editor of all time.<br><br>It’s cool because:<br><ul><li>Supports wide range of video format</li><li>Easy customization</li><li>Various tools and effects for editing</li><li>Supports making template or saving effects</li><li>Exporting as various video format</li></ul><hr><center><img width='90%' src='gallery/kawsar/godot.jpg'></center><br><li><a href='https://godotengine.org'>GODOT Game engine</a></li>If you want to develop game in a different manner that supports multiple devices in one game engine which also has big community and constantly upgrading to make an great impact on gaming industry and for our favorite part of being an open source then Godot is the game engine you are looking for. Easy to learn using GDScript which is most like Python. Big community to get help if you ever get stuck and wide range of device supporting it.<br><br>It’s cool because:<br><ul><li>Built in game language editor of GDScript</li><li>Easy to learn form social media and good community</li><li>Innovative design</li><li>Dedicated 2D engine</li><li>Simple and powerful 3D</li><li>Release on all platform</li></ul></ol>"],
  "img":[
    "./gallery/shupto/beach.jpg","./gallery/kawsar/openSp.png"
  ],
  "record":[
  "2","0","0","0"
]
}